apaikan/myCub/firmware/ADA/liblm4f120/lm4f120/pin_map.h
#define U1RX_PERIPH             SYSCTL_PERIPH_GPIOC
#define U1RX_PORT               GPIO_PORTC_BASE
#define U1RX_PIN                GPIO_PIN_6

#define U1TX_PERIPH             SYSCTL_PERIPH_GPIOC
#define U1TX_PORT               GPIO_PORTC_BASE
#define U1TX_PIN                GPIO_PIN_7

#define USB0EPEN_PERIPH         SYSCTL_PERIPH_GPIOH
#define USB0EPEN_PORT           GPIO_PORTH_BASE
#define USB0EPEN_PIN            GPIO_PIN_3

#define USB0PFLT_PERIPH         SYSCTL_PERIPH_GPIOH
#define USB0PFLT_PORT           GPIO_PORTH_BASE
#define USB0PFLT_PIN            GPIO_PIN_4

#endif // PART_LM3S3748

//*****************************************************************************
//
// LM3S3749 Port/Pin Mapping Definitions
//
//*****************************************************************************
#ifdef PART_LM3S3749

#define ADC0_PERIPH             SYSCTL_PERIPH_GPIOE
#define ADC0_PORT               GPIO_PORTE_BASE
#define ADC0_PIN                GPIO_PIN_7

#define ADC1_PERIPH             SYSCTL_PERIPH_GPIOE
#define ADC1_PORT               GPIO_PORTE_BASE
#define ADC1_PIN                GPIO_PIN_6

#define ADC2_PERIPH             SYSCTL_PERIPH_GPIOE
#define ADC2_PORT               GPIO_PORTE_BASE
#define ADC2_PIN                GPIO_PIN_5

#define ADC3_PERIPH             SYSCTL_PERIPH_GPIOE
#define ADC3_PORT               GPIO_PORTE_BASE
#define ADC3_PIN                GPIO_PIN_4

#define ADC4_PERIPH             SYSCTL_PERIPH_GPIOD
#define ADC4_PORT               GPIO_PORTD_BASE
#define ADC4_PIN                GPIO_PIN_7

#define ADC5_PERIPH             SYSCTL_PERIPH_GPIOD
#define ADC5_PORT               GPIO_PORTD_BASE
#define ADC5_PIN                GPIO_PIN_6

#define ADC6_PERIPH             SYSCTL_PERIPH_GPIOD
#define ADC6_PORT               GPIO_PORTD_BASE
#define ADC6_PIN                GPIO_PIN_5

#define ADC7_PERIPH             SYSCTL_PERIPH_GPIOD
#define ADC7_PORT               GPIO_PORTD_BASE
#define ADC7_PIN                GPIO_PIN_4

#define C0O_PERIPH              SYSCTL_PERIPH_GPIOF
#define C0O_PORT                GPIO_PORTF_BASE
#define C0O_PIN                 GPIO_PIN_4

#define C0_MINUS_PERIPH         SYSCTL_PERIPH_GPIOB
#define C0_MINUS_PORT           GPIO_PORTB_BASE
#define C0_MINUS_PIN            GPIO_PIN_4

#define C0_PLUS_PERIPH          SYSCTL_PERIPH_GPIOB
#define C0_PLUS_PORT            GPIO_PORTB_BASE
#define C0_PLUS_PIN             GPIO_PIN_6

#define C1O_PERIPH              SYSCTL_PERIPH_GPIOC
#define C1O_PORT                GPIO_PORTC_BASE
#define C1O_PIN                 GPIO_PIN_7

#define C1_MINUS_PERIPH         SYSCTL_PERIPH_GPIOB
#define C1_MINUS_PORT           GPIO_PORTB_BASE
#define C1_MINUS_PIN            GPIO_PIN_5

#define C1_PLUS_PERIPH          SYSCTL_PERIPH_GPIOC
#define C1_PLUS_PORT            GPIO_PORTC_BASE
#define C1_PLUS_PIN             GPIO_PIN_5

#define CCP0_PERIPH             SYSCTL_PERIPH_GPIOD
#define CCP0_PORT               GPIO_PORTD_BASE
#define CCP0_PIN                GPIO_PIN_3

#define CCP1_PERIPH             SYSCTL_PERIPH_GPIOA
#define CCP1_PORT               GPIO_PORTA_BASE
#define CCP1_PIN                GPIO_PIN_6

#define CCP2_PERIPH             SYSCTL_PERIPH_GPIOF
#define CCP2_PORT               GPIO_PORTF_BASE
#define CCP2_PIN                GPIO_PIN_5

#define CCP3_PERIPH             SYSCTL_PERIPH_GPIOA
#define CCP3_PORT               GPIO_PORTA_BASE
#define CCP3_PIN                GPIO_PIN_7

#define CCP4_PERIPH             SYSCTL_PERIPH_GPIOF
#define CCP4_PORT               GPIO_PORTF_BASE
#define CCP4_PIN                GPIO_PIN_7

#define CCP5_PERIPH             SYSCTL_PERIPH_GPIOC
#define CCP5_PORT               GPIO_PORTC_BASE
#define CCP5_PIN                GPIO_PIN_4

#define CCP6_PERIPH             SYSCTL_PERIPH_GPIOD
#define CCP6_PORT               GPIO_PORTD_BASE
#define CCP6_PIN                GPIO_PIN_2

#define FAULT0_PERIPH           SYSCTL_PERIPH_GPIOG
#define FAULT0_PORT             GPIO_PORTG_BASE
#define FAULT0_PIN              GPIO_PIN_2

#define FAULT1_PERIPH           SYSCTL_PERIPH_GPIOG
#define FAULT1_PORT             GPIO_PORTG_BASE
#define FAULT1_PIN              GPIO_PIN_4

#define FAULT2_PERIPH           SYSCTL_PERIPH_GPIOG
#define FAULT2_PORT             GPIO_PORTG_BASE
#define FAULT2_PIN              GPIO_PIN_3

#define FAULT3_PERIPH           SYSCTL_PERIPH_GPIOH
#define FAULT3_PORT             GPIO_PORTH_BASE
#define FAULT3_PIN              GPIO_PIN_2

#define I2C0SCL_PERIPH          SYSCTL_PERIPH_GPIOB
#define I2C0SCL_PORT            GPIO_PORTB_BASE
#define I2C0SCL_PIN             GPIO_PIN_2

#define I2C0SDA_PERIPH          SYSCTL_PERIPH_GPIOB
#define I2C0SDA_PORT            GPIO_PORTB_BASE
#define I2C0SDA_PIN             GPIO_PIN_3

#define I2C1SCL_PERIPH          SYSCTL_PERIPH_GPIOG
#define I2C1SCL_PORT            GPIO_PORTG_BASE
#define I2C1SCL_PIN             GPIO_PIN_0

#define I2C1SDA_PERIPH          SYSCTL_PERIPH_GPIOG
#define I2C1SDA_PORT            GPIO_PORTG_BASE
#define I2C1SDA_PIN             GPIO_PIN_1

#define IDX0_PERIPH             SYSCTL_PERIPH_GPIOG
#define IDX0_PORT               GPIO_PORTG_BASE
#define IDX0_PIN                GPIO_PIN_5

#define NMI_PERIPH              SYSCTL_PERIPH_GPIOB
#define NMI_PORT                GPIO_PORTB_BASE
#define NMI_PIN                 GPIO_PIN_7

#define PHA0_PERIPH             SYSCTL_PERIPH_GPIOF
#define PHA0_PORT               GPIO_PORTF_BASE
#define PHA0_PIN                GPIO_PIN_6

#define PHB0_PERIPH             SYSCTL_PERIPH_GPIOC
#define PHB0_PORT               GPIO_PORTC_BASE
#define PHB0_PIN                GPIO_PIN_6

#define PWM0_PERIPH             SYSCTL_PERIPH_GPIOF
#define PWM0_PORT               GPIO_PORTF_BASE
#define PWM0_PIN                GPIO_PIN_0

#define PWM1_PERIPH             SYSCTL_PERIPH_GPIOF
#define PWM1_PORT               GPIO_PORTF_BASE
#define PWM1_PIN                GPIO_PIN_1

#define PWM2_PERIPH             SYSCTL_PERIPH_GPIOH
#define PWM2_PORT               GPIO_PORTH_BASE
#define PWM2_PIN                GPIO_PIN_0

